## **1.	Data Inconsistency**

#### **1.	1.1.	Data Inconsistency by Data Type / Format**

In [1439]:
# Import necessary libraries
import pandas as pd
import numpy as np
from datetime import datetime
import re

# Load the dataset from github
df = pd.read_csv("https://raw.githubusercontent.com/tabassumgulfaraz-ds/machine_learning_1.0/main/files_and_datasets/f_ds5_II/inconsistent_data.csv")

# check the shape i.e. number of rows and columns also called dimensions of the dataset
print(f"Dataset Shape: {df.shape}")

# Display the first few rows of the dataset to understand its structure and identify any inconsistencies
df.head()

Dataset Shape: (30, 11)

,Name,Age,Gender,Country,DateOfBirth,IsActive,Price,Salary,RegistrationDate,FatherAge,SonAge
0,James Taylor,25,M,USA,1/15/1999,TRUE,$100,50000,1/10/2020,55,25
1,james taylor,300,Male,U.S.A,15/01/1999,1,100,NaN,10/1/2020,50,25
2,Sarah Connor,28,F,United State,5/20/1996,Yes,USD 100,60000,6/15/2019,58,28
3,Sarah Connor,28,female,United State of America,20-05-1996,TRUE,$120,60000,15-06-2019,58,28
4,Michael Scott,150,m,USA,3/10/2010,FALSE,85.5,0,3/1/2021,30,25

**1.1.1.	Numerical Data**

In [1440]:
# Identify unique values in the 'Age' column to find inconsistencies
sorted(df['Age'].unique())

[np.int64(13),
 np.int64(15),
 np.int64(20),
 np.int64(22),
 np.int64(25),
 np.int64(27),
 np.int64(28),
 np.int64(29),
 np.int64(32),
 np.int64(35),
 np.int64(38),
 np.int64(42),
 np.int64(45),
 np.int64(50),
 np.int64(150),
 np.int64(156),
 np.int64(180),
 np.int64(240),
 np.int64(264),
 np.int64(300),
 np.int64(324),
 np.int64(420)]

In [1441]:
# Identify ages > 100 (these are in months, convert to years)
df['Age'] = df['Age'].apply(lambda x: x // 12 if x > 100 else x)

In [1442]:
# Display summary statistics of the 'Age' column to check for any remaining inconsistencies
df['Age'].describe()

count    30.000000
mean     29.633333
std      10.990539
min      12.000000
25%      22.000000
50%      28.500000
75%      37.250000
max      50.000000
Name: Age, dtype: float64

In [1443]:
# Display unique values in the 'Age' column after cleaning to confirm that all ages are now in years
sorted(df['Age'].unique())

[np.int64(12),
 np.int64(13),
 np.int64(15),
 np.int64(20),
 np.int64(22),
 np.int64(25),
 np.int64(27),
 np.int64(28),
 np.int64(29),
 np.int64(32),
 np.int64(35),
 np.int64(38),
 np.int64(42),
 np.int64(45),
 np.int64(50)]

In [1444]:
# Display the first few rows of the cleaned dataset to verify the changes
df['Age'].head()

0    25
1    25
2    28
3    28
4    12
Name: Age, dtype: int64

**1.1.2.	Categorical / Text Data**

In [1445]:
# Display unique values in the 'Gender' column to identify inconsistencies
df['Gender'].value_counts()

Gender
M         7
F         5
Male      4
female    4
m         3
Female    3
f         2
male      2
Name: count, dtype: int64

In [1446]:
# Standardize Gender values
gender_mapping = {
    'M': 'male',
    'male': 'male',
    'm': 'male',
    'Male': 'male',
    'F': 'female',
    'female': 'female',
    'f': 'female',
    'Female': 'female'
}

# Apply the mapping to standardize the 'Gender' column
df['Gender'] = df['Gender'].map(gender_mapping)

# Display the unique values in the 'Gender' column after cleaning to confirm that all values are standardized
df['Gender'].value_counts()

Gender
male      16
female    14
Name: count, dtype: int64

**1.1.3.	Date / Time Data**

In [1447]:
df['DateOfBirth'].head(10)

0     1/15/1999
1    15/01/1999
2     5/20/1996
3    20-05-1996
4     3/10/2010
5     3/10/1989
6     8/25/1998
7    25/08/2004
8    11/30/1979
9    30/11/1979
Name: DateOfBirth, dtype: str

In [1448]:
# Function to parse different date formats
def standardize_date(date_str):
    if pd.isna(date_str):
        return np.nan
    try:
        # Try different date formats
        for fmt in ['%Y-%m-%d', '%d/%m/%Y', '%d-%m-%Y', '%m/%d/%Y', '%m-%d-%Y']:
            try:
                return pd.to_datetime(date_str, format=fmt).strftime('%Y-%m-%d')
            except:
                continue
        return np.nan
    except:
        return np.nan

df['DateOfBirth'] = df['DateOfBirth'].apply(standardize_date)

# After cleaning (ISO format YYYY-MM-DD):
df['DateOfBirth'].head(10)

0    1999-01-15
1    1999-01-15
2    1996-05-20
3    1996-05-20
4    2010-10-03
5    1989-10-03
6    1998-08-25
7    2004-08-25
8    1979-11-30
9    1979-11-30
Name: DateOfBirth, dtype: str

**1.1.4.	Boolean / Binary Data**

In [1449]:
# check the unique values in the 'IsActive' column to identify inconsistencies
df['IsActive'].value_counts()

IsActive
TRUE     10
0         5
1         4
Yes       4
FALSE     3
No        2
yes       2
Name: count, dtype: int64

In [1450]:
# Standardize Boolean values in 'IsActive' column to handle inconsistencies.
def standardize_boolean(value):
    if isinstance(value, str):
        value = value.strip().lower()
        if re.match(r'^(true|yes|1)$', value):
            return True
        elif re.match(r'^(false|no|0)$', value):
            return False
    elif isinstance(value, (int, float)):
        if value == 1:
            return True
        elif value == 0:
            return False
    return np.nan

# Apply the standardization function to the 'IsActive' column and convert to lowercase string for consistency
df['IsActive'] = df['IsActive'].map(standardize_boolean).astype(str).str.lower()

# Display the unique values in the 'IsActive' column after cleaning to confirm that all values are standardized
df['IsActive'].value_counts()

IsActive
true     20
false    10
Name: count, dtype: int64

**1.1.5.	Multi-format / Mixed-type Columns**

In [1451]:
# Display the first few rows of the 'Price' column to identify inconsistencies
df['Price'].head(10)

0      $100
1        100
2    USD 100
3      $120
4       85.5
5       85.5
6      $200
7        200
8        150
9      $150
Name: Price, dtype: str

In [1452]:
# check the data type of the 'Price' column to confirm that it is not numeric due to inconsistencies
df['Price'].dtype

In [1453]:
# Function to clean price values
def clean_price(price):
    try:
        # Remove currency symbols and text
        price_str = str(price)
        # Remove $, USD, commas, quotes, and spaces
        cleaned = re.sub(r'[\$,USD"\s]', '', price_str)
        return float(cleaned)
    except:
        return np.nan

# Apply the cleaning function to the 'Price' column and convert it to numeric 
df['Price'] = df['Price'].apply(clean_price)

# Display the first few rows of the 'Price' column after cleaning to confirm that all values are now numeric and cleaned
df['Price'].head(10)

0    100.0
1    100.0
2    100.0
3    120.0
4     85.5
5     85.5
6    200.0
7    200.0
8    150.0
9    150.0
Name: Price, dtype: float64

In [1454]:
# check the data type of the 'Price' column to confirm that it is not numeric due to inconsistencies
df['Price'].dtype

dtype('float64')

**1.1.6.	Missing / Null Values**

In [1455]:
# check the count of missing values in the 'Salary' column, isna() considers NaN, None, and pandas.Nat values as missing.
df['Salary'].isna().sum()
# Values like 0, unknown, or the string 'nan' are not considered missing by isna().sum().

np.int64(3)

In [1456]:
# Display unique values in the 'Salary' column to identify inconsistencies
df['Salary'].unique()

<StringArray>
[  '50000',       nan,   '60000',       '0',   '45000', 'Unknown',   '75000',
   '55000',   '48000',   '62000',   '70000',   '58000',   '52000',   '65000',
   '47000',   '80000',   '59000',   '72000']
Length: 18, dtype: str

In [1457]:
# Replace inconsistent missing values with NaN, standardize missing values to NaN
df['Salary'] = df['Salary'].replace(['Unknown', 'NaN', 0, '0'], np.nan)

In [1458]:
# check the count of missing values in the 'Salary' column
df['Salary'].isna().sum()

np.int64(8)

In [1459]:
# Convert Salary column to numeric type
df['Salary'] = pd.to_numeric(df['Salary'], errors='coerce')

# Option 1: Fill with median
# df['Salary'].fillna(df['Salary'].median(), inplace=True)
df['Salary'] = df['Salary'].fillna(df['Salary'].median())

# Option 2: Fill with mean
# df['Salary'].fillna(df['Salary'].mean(), inplace=True)
# df['Salary'] = df['Salary'].fillna(df['Salary'].mean())

df['Salary'].isna().sum()

np.int64(0)

**1.1.7.	Duplicated / Redundant Records**

In [1460]:
# Check the length of the dataset before removing duplicates
len(df)

30

In [1461]:
# Standardize Name column for duplicate detection
df['Name_Standardized'] = df['Name'].str.lower().str.strip()

In [1462]:
# # Display potential duplicates based on standardized names 
df[df.duplicated(subset=['Name_Standardized'], keep=False)][['Name', 'Age', 'Country']].sort_values('Name')

               Name  Age                  Country
14         Anna Lee   35                    China
15         Anna Lee   35                    china
21      Chris Evans   38             United State
20      Chris Evans   38                      USA
17     DAVID MILLER   29                  GERMANY
16     David Miller   29                  Germany
6       Emma Watson   20                       UK
9          JOHN DOE   45                   canada
0      James Taylor   25                      USA
8          John Doe   45                   Canada
10     Lisa Simpson   15                      USA
11     Lisa Simpson   15                    U.S.A
29     Mark Johnson   42                   CANADA
28     Mark Johnson   42                   Canada
5     Michael Scott   35                      USA
4     Michael Scott   12                      USA
22    Olivia Harris   13                    India
26     Rachel Green   27                       UK
12     Robert Brown   32                Australia
3      Sarah Connor   28  United State of America
2      Sarah Connor   28             United State
18    Sophie Turner   22                   France
25  THOMAS ANDERSON   50                    U.S.A
24  Thomas Anderson   50                      USA
7       emma watson   20           United Kingdom
1      james taylor   25                    U.S.A
23    olivia harris   13                    india
27     rachel green   27           United Kingdom
13     robert brown   32                australia
19    sophie turner   22                   france

In [1463]:
# Remove duplicates keeping first occurrence
df = df.drop_duplicates(subset=['Name_Standardized'], keep='first')

In [1464]:
# Check the length of the dataset after removing duplicates
len(df)

15

In [1465]:
# Drop the helper column
df.drop('Name_Standardized', axis=1, inplace=True)

# Update df (optional step to ensure df is updated, if we changed df_cleaned to df)
df = df.copy()

In [1466]:
# Check for any remaining duplicates in the dataset after cleaning.
df.duplicated().sum()

np.int64(0)

**1.1.8.	Logical Conflicts**

In [1467]:
# Logical Conflicts (Age vs DateOfBirth, FatherAge vs SonAge)
# Check 1: Age vs DateOfBirth consistency
current_year = 2026
def calculate_age_from_dob(dob):
    try:
        dob_date = pd.to_datetime(dob)
        return current_year - dob_date.year
    except:
        return np.nan

# print function calculate_age_from_dob for testing
print(calculate_age_from_dob('1999-03-03'))  # Should return 35

27

In [1468]:
# Calculate age from DateOfBirth and create a new column 'Calculated_Age' to compare with the existing 'Age' column 
df['Calculated_Age'] = df['DateOfBirth'].apply(calculate_age_from_dob)

In [1469]:
# Allowing a 1-year tolerance for minor discrepancies between the reported age and the calculated age from DateOfBirth, we can identify logical conflicts where the difference is greater than 1 year.
df['Age_Mismatch'] = abs(df['Age'] - df['Calculated_Age']) > 1  

# This will give us the count of logical conflicts between Age and DateOfBirth.
df['Age_Mismatch'].sum()

np.int64(13)

In [1470]:
# Display rows with logical conflicts between Age and DateOfBirth to investigate the discrepancies 
df[df['Age_Mismatch']][['Name', 'Age', 'DateOfBirth', 'Calculated_Age']]

               Name  Age DateOfBirth  Calculated_Age
0      James Taylor   25  1999-01-15              27
2      Sarah Connor   28  1996-05-20              30
4     Michael Scott   12  2010-10-03              16
6       Emma Watson   20  1998-08-25              28
8          John Doe   45  1979-11-30              47
12     Robert Brown   32  1992-07-18              34
16     David Miller   29  1995-01-12              31
18    Sophie Turner   22  2002-04-22              24
20      Chris Evans   38  1986-06-13              40
22    Olivia Harris   13  2011-10-28              15
24  Thomas Anderson   50  1974-09-08              52
26     Rachel Green   27  1997-03-17              29
28     Mark Johnson   42  1982-05-25              44

In [1471]:
# Fix by recalculating from DateOfBirth
df['Age'] = df['Calculated_Age']
df.drop(['Calculated_Age', 'Age_Mismatch'], axis=1, inplace=True)

In [1472]:
# Check 2: FatherAge vs SonAge (Father must be older)
df['Age_Conflict'] = df['SonAge'] >= df['FatherAge']

In [1473]:
# This will give us the count of logical conflicts where SonAge is greater than or equal to FatherAge. 
df['Age_Conflict'].sum()

np.int64(0)

In [1474]:
# Display rows with logical conflicts between FatherAge and SonAge to investigate the discrepancies 
df[df['Age_Conflict']][['Name', 'FatherAge', 'SonAge']]

Empty DataFrame
Columns: [Name, FatherAge, SonAge]
Index: []

In [1475]:
# Remove conflicting rows and keep only consistent data for analysis
df = df[~df['Age_Conflict']]

# Drop the helper column after removing conflicting rows
df.drop('Age_Conflict', axis=1, inplace=True)

**1.1.9.	Naming Conversion**

In [1476]:
# Install Libraries
%conda install pycountry thefuzz
# pip install pycountry thefuzz

3 channel Terms of Service accepted
Channels:
 - defaults
Platform: win-64
Collecting package metadata (repodata.json): done
Solving environment: done

# All requested packages already installed.


Note: you may need to restart the kernel to use updated packages.

==> WARNING: A newer version of conda exists. <==
    current version: 25.5.1
    latest version: 26.1.0

Please update conda by running

    $ conda update -n base -c defaults conda

In [1477]:
# Import libraries for fuzzy matching
import pycountry
from thefuzz import process

In [1478]:
# Display unique values in the 'Country' column to identify inconsistencies
df['Country'].unique()

<StringArray>
[         'USA', 'United State',           'UK',       'Canada',
    'Australia',        'China',      'Germany',       'France',
        'India']
Length: 9, dtype: str

In [1479]:
# .strip() â†’ removes extra spaces from beginning and end
# .title() converts the first letter of each word to uppercase and the remaining letters to lowercase.
# Automatic standardization using title case and strip
df['Country'] = df['Country'].str.strip().str.title()

In [1480]:
# Display the first few rows of the 'Country' column after cleaning to confirm that all values are standardized
df['Country'].head()

0             Usa
2    United State
4             Usa
6              Uk
8          Canada
Name: Country, dtype: str

In [1481]:
# Get official ISO country list/names
official_countries = [country.name for country in pycountry.countries]

In [1482]:
# ISO + Fuzzy Matching for Country Standardization
def clean_country(name):
    
    # 1 Try direct ISO lookup first (safest)
    try:
        return pycountry.countries.lookup(name).name
    except:
        pass
    
    # 2 Use fuzzy matching for longer names only (avoid short confusion like uk)
    if len(name) > 4:
        match, score = process.extractOne(name, official_countries)
        if score >= 90:
            return match
    
    # 3 If not matched, return original (we will inspect later)
    return name

In [1483]:
# Apply the cleaning function to the 'Country' column
df['Country'] = df['Country'].apply(clean_country)

In [1484]:
# List to store invalid countries that are not matched to ISO standards
invalid = [] 
for country in df['Country'].unique():
    try:
        pycountry.countries.lookup(country)
    except:
        invalid.append(country)

print("Invalid Countries Found:", invalid)

Invalid Countries Found: ['Uk']

In [1485]:
# Manually fix remaining invalid countries based on inspection
manual_fix = { 
    'uk': 'United Kingdom',
    'u.k': 'United Kingdom',
    'Uk': 'United Kingdom',
    'U.K': 'United Kingdom'
}

df['Country'] = df['Country'].replace(manual_fix)

In [1486]:
# Display unique values in the 'Country' column to identify inconsistencies
df['Country'].unique()

<StringArray>
[ 'United States', 'United Kingdom',         'Canada',      'Australia',
          'China',        'Germany',         'France',          'India']
Length: 8, dtype: str

**1.1.10.	Typographical Mistake**

In [1487]:
# Typographical Mistakes (Name column)
df['Name'].head(10)

0      James Taylor
2      Sarah Connor
4     Michael Scott
6       Emma Watson
8          John Doe
10     Lisa Simpson
12     Robert Brown
14         Anna Lee
16     David Miller
18    Sophie Turner
Name: Name, dtype: str

In [1488]:
# Standardize names: Title case, we can use .str.lower() for case-insensitive matching.
df['Name'] = df['Name'].str.title().str.strip()

# Display the first few rows of the 'Name' column after cleaning to confirm that all values are standardized
df['Name'].head(10)

0      James Taylor
2      Sarah Connor
4     Michael Scott
6       Emma Watson
8          John Doe
10     Lisa Simpson
12     Robert Brown
14         Anna Lee
16     David Miller
18    Sophie Turner
Name: Name, dtype: str

**1.1.11.	Contradictory Data**

In [1489]:
# Contradictory Data (Already handled in 1.1.8)

##### â–  **Final cleaned dataset summary**

In [1490]:
df.shape

(15, 11)

In [1491]:
df.dtypes

Name                    str
Age                   int64
Gender                  str
Country                 str
DateOfBirth             str
IsActive                str
Price               float64
Salary              float64
RegistrationDate        str
FatherAge             int64
SonAge                int64
dtype: object

In [1492]:
df.isna().sum()

Name                0
Age                 0
Gender              0
Country             0
DateOfBirth         0
IsActive            0
Price               0
Salary              0
RegistrationDate    0
FatherAge           0
SonAge              0
dtype: int64

In [1493]:
df.head(5)

,Name,Age,Gender,Country,DateOfBirth,IsActive,Price,Salary,RegistrationDate,FatherAge,SonAge
0,James Taylor,27,male,United States,1999-01-15,true,100.0,50000.0,1/10/2020,55,25
2,Sarah Connor,30,female,United States,1996-05-20,true,100.0,60000.0,6/15/2019,58,28
4,Michael Scott,16,male,United States,2010-10-03,false,85.5,60000.0,3/1/2021,30,25
6,Emma Watson,28,female,United Kingdom,1998-08-25,true,200.0,60000.0,12/20/2018,62,20
8,John Doe,47,male,Canada,1979-11-30,true,150.0,55000.0,7/22/2017,70,45

### â˜… **Upload Cleaned Dataset Directly to GitHub**

In [1494]:
import requests # for making HTTP requests
import base64 # for encoding/decoding base64 data
import json # for handling JSON data

In [1495]:
# GitHub repository details
GITHUB_USERNAME = "tabassumgulfaraz-ds" # âš ï¸ REPLACE THIS WITH YOUR GITHUB USERNAME
REPO_NAME = "machine_learning_1.0"  # âš ï¸ REPLACE THIS WITH YOUR REPOSITORY NAME
FILE_PATH = "files_and_datasets/f_ds5_II/consistent_data.csv" # âš ï¸ REPLACE THIS WITH YOUR FILE PATH
BRANCH = "main" # âš ï¸ REPLACE THIS WITH YOUR BRANCH NAME

In [1496]:
# Convert DataFrame to CSV string
csv_content = df.to_csv(index=False)

In [1497]:
# Encode content to base64 (required by GitHub API)
content_encoded = base64.b64encode(csv_content.encode()).decode()

In [1498]:
# GitHub API URL
api_url = f"https://api.github.com/repos/{GITHUB_USERNAME}/{REPO_NAME}/contents/{FILE_PATH}"

**â‰ Generate Token**  
- Open this link: https://github.com/settings/tokens/new  
- Confirm Access via "Use GitHub Mobile or "Send a code via email"  
- Note "demo_note"
- Expiration "No Expiration", but it's upto you.  
- Tick on "repo"
- Click on "Generate token"
- "Copy Token"

In [1499]:
# You need to provide your GitHub Personal Access Token here
GITHUB_TOKEN = "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"  # âš ï¸ REPLACE THIS WITH YOUR TOKEN

In [1500]:
# Request headers
headers = {
    "Authorization": f"token {GITHUB_TOKEN}",
    "Accept": "application/vnd.github.v3+json"
}

In [1501]:
# Request body
data = {
    "message": "Add cleaned dataset - consistent_data.csv",
    "content": content_encoded,
    "branch": BRANCH
}

In [1502]:
# Check if file already exists (to get SHA for update)
try:
    check_response = requests.get(api_url, headers=headers)
    if check_response.status_code == 200:
        # File exists, need SHA to update
        sha = check_response.json()["sha"]
        data["sha"] = sha
except:
    print("Creating new file...")

In [1503]:
# Upload/Update file
response = requests.put(api_url, headers=headers, data=json.dumps(data))

In [1504]:
if response.status_code in [200, 201]:
    # File location:
    print(f"   {api_url.replace('api.github.com/repos', 'github.com').replace('/contents/', '/blob/main/')}")
    # Raw file URL:
    print(f"   https://raw.githubusercontent.com/{GITHUB_USERNAME}/{REPO_NAME}/main/{FILE_PATH}")
    # You can now load it using:
    print(f'   df = pd.read_csv("https://raw.githubusercontent.com/{GITHUB_USERNAME}/{REPO_NAME}/main/{FILE_PATH}")')
else:
    # Upload failed!"
    print(f"Status code: {response.status_code}")
    print(f"Response: {response.json()}")

   https://github.com/tabassumgulfaraz-ds/machine_learning_1.0/blob/main/files_and_datasets/f_ds5_II/consistent_data.csv
   https://raw.githubusercontent.com/tabassumgulfaraz-ds/machine_learning_1.0/main/files_and_datasets/f_ds5_II/consistent_data.csv
   df = pd.read_csv("https://raw.githubusercontent.com/tabassumgulfaraz-ds/machine_learning_1.0/main/files_and_datasets/f_ds5_II/consistent_data.csv")